Repository: asianlegacylibrary/all-stripe-donation
Catalog: locale/wp-stripe-donation-*.po
Languages: ar

source: Other Amount
ar: مبلغ آخر

source: Address
ar: العنوان

source: Address Label
ar: اسم حقل العنوان

source: In memory of
ar: لذكرة

source: In memory of field
ar: حقل لذكرة

source: All Donations
ar: كل التبرعات

source: Amount
ar: المبلغ

source: Campaign Options
ar: خيارات الحملة

source: Allow custom amount
ar: السماح للمستخدم بإختيار مبلغ

source: Campaign
ar: الحملة

source: Currency
ar: العملة

source: Recurring
ar: دفع متكرر

source: Date
ar: التاريخ

source: Display Header
ar: عرض الواجهة

source: Donate Amount Label
ar: عنوان حقل تبرع بمبلغ

source: Custom Amount Label
ar: عنوان حقل المبلغ الإحتياري

source: Donate Button Text
ar: نص زر تبرع بمبلغ

source: Donation For
ar: تبرع لصالح

source: Donation For Label
ar: عنوان حقل تبرع لصالح

source: Donation Form Banner
ar: رأس استمارة التبرع

source: Donation Info Email
ar: العنوان البريدي لمعلومات التبرع

source: Donation Options
ar: خيارات التبرع

source: Donation Title
ar: عنوان التبرع

source: Donation information will send to this email
ar: بيانات التبرع سترسل إلى عنوان البريد الإلكترةوني هذا

source: Email
ar: البريد الإلكتروني

source: Email Label
ar: اسم حقل عنوان البريد الإلكتروني

source: Phone
ar: الهاتف

source: Phone Label
ar: عنوان حقل الهاتف

source: Country
ar: البلد

source: Country Label
ar: عنوان حقل المدينة

source: State
ar: الولاية

source: State Label
ar: عنوان حقل الولاية

source: City
ar: المدينة

source: City Label
ar: عنوان حقل المدينة

source: ZIP
ar: الرمز

source: ZIP Label
ar: عنوان حقل الرمز

source: First Name
ar: الأسم الأول

source: First Name Label
ar: اسم حقل الأسم الأول

source: General Settings
ar: الإعدادات العامة

source: Key Settings
ar: إعدادات المفاتيح

source: Enter Your Amount
ar: أدخل المبلغ

source: Last Name
ar: الإسم الثاني

source: Last Name Label
ar: اسم حقل الإسم الثاني

source: List of all donations
ar: عرض كل التبرعات

source: Payment Modal Logo
ar: صورة لإستمارة الدفع للإطار المنبثق

source: Private Key
ar: المفتاح المشفر الخاص

source: Secret Key
ar: المفتاح المشفر السري

source: Select a Template
ar: إختر قالب

source: Select a banner
ar: إختر شعار البداية

source: Select a logo
ar: إختر شعار

source: Shortcode
ar: كود مختصر

source: Template Settings
ar: إعدادات القالب

source: Update General Settings
ar: تحديث الإعدادات العامة

source: Update Settings
ar: تحديث الإعدادات

source: Update Temp Settings
ar: تحديث الإعدادات الموءقتة

source: Use comma "," separated values
ar: ضع فاصلة "," بين القيم

source: WP Stripe Donation Key Settings
ar: إعدادات المفتايح

source: WP Stripe General Settings
ar: الإعدادات العامة

source: WP Stripe Template Settings
ar: إعدادات القالب

source: Webhooks Key
ar: مفتاح إشعارات سترايب

source: Choose Your Amount
ar: إختر المبلغ

source: One Time Label
ar: عنوان زر مرة واحدة

source: One Time
ar: مرة واحدة

source: Monthly Label
ar: عنوان زر شهريا

source: Monthly
ar: شهريا

source: Card Label
ar: عنوان حقل بطاقة الدفع

source: Credit Card Details
ar: بطاقة الدفع

source: Card Agreement
ar: اتفاقية الدفع

source: By clicking submit, you are agreeing to submitting payment
ar: من خلال الضغط على تبرع الآن, إنك توافق على دفع المبلغ

source: Submit
ar: تبرع الآن

source: USD
ar: د.أ

source: Please Enter Your First Name
ar: الرجاء إدخال اسمك الأول

source: Please Enter Your Last Name
ar: الرجاء إدخال اسم العائلة

source: Please Enter Your Address
ar: الرجاء إدخال عنوانك

source: Please Enter Email
ar: الرجاء إدخال عنوان البريد الإلكتروني

source: Please Enter Valid Email
ar: الرجاء إدخال عنوان البريد الإلكتروني صحيح

source: Please select an amount to donate
ar: الرجاء إختيار مبلغ للتبرع

source: Secret key missing
ar: المفتاح السري غير موجود

source: All Amounts
ar: كل المبالغ

source: Add Amount
ar: اضف مبلغ

source: Edit Amount
ar: تعديل مبلغ

source: Delete Amount
ar: حذف مبلغ

source: Stripe Product ID
ar: معرف سترايب للمنتج

source: Actions
ar: إجراءات

source: Amount already exists
ar: المبلغ موجود

source: Amount updated successfully
ar: تم تحديث المبلغ بنجاح

source: Failed to update product price
ar: تعذر تحديث سعر المنتج

source: An error occurred during deleting the amount
ar: حصل خطأ اثناء حذف المبلغ

source: Amount is not valid
ar: المبلغ غير صحيح

source: Amount is created successfully
ar: تم إضافة المبلغ بنجاح

source: Your information updated successfully
ar: تم تعديل معلوماتك بنجاح

source: Failed to create donation
ar: فشل في إضافة تبرع

source: Thank you for your donation
ar: شكرا للتبرع

source: Please fill all the required fields
ar: الرجاء تعبئة كافة الحقول المطلوبة

source: Donation not found
ar: لم يتم العثور على التبرع

source: Amount not found
ar: لم يتم العثور على المبلغ

source: Custom Amount is not valid
ar: المبلغ غير صحيح

source: Recurring is not valid
ar: المبلغ الشهري ليس صالح

source: Invalid payload
ar: البيانات غير صحيحة

source: Invalid signature
ar: التوقيع غير صحيح
